[
    {
        "experience": [
            "Building the official SHEROS of Color club website from the ground up using React.js and Tailwind CSS, creating a modern, fully responsive web platform that serves as the central digital hub for the community.",
            "Designed and implemented a comprehensive user interface showcasing upcoming events, past activities, leadership profiles, member resources, and membership registration features, improving community engagement and organizational visibility.",
            "Developed reusable React components with Tailwind CSS utilities to ensure consistent design language, optimal performance across devices, and maintainable codebase architecture for future scalability.",
            "Amplified visibility for women of color in technology at Northeastern University by creating an accessible, professional web presence that effectively communicates the organization's mission, initiatives, and impact.",
            "Collaborated with club leadership to translate organizational goals into technical requirements, iterating on design and functionality based on stakeholder feedback to ensure the platform meets community needs."
        ],
        "role": "Web Developer",
        "company": "Khoury SHEROS of Color",
        "timeline": "October 2025 - Jan 2026",
        "location": "Boston, Massachusetts, United States"
    },
    {
        "experience": [
            "Conducted advanced cybersecurity and networking research at MonIoTr Labs within Khoury College of Computer Sciences, analyzing real-time and archived network traffic from 100+ IoT devices deployed on the Sphere testbed infrastructure.",
            "Performed deep packet inspection and comprehensive protocol analysis (DNS, TLS/SSL, HTTP/HTTPS, MQTT) using Wireshark and custom scripts to enable precise device fingerprinting and behavioral profiling of diverse IoT ecosystems.",
            "Identified security vulnerabilities, malicious behavior patterns, and potential attack vectors through systematic traffic pattern analysis, anomaly detection, and correlation of device communication behaviors across network layers.",
            "Evaluated and enhanced the reliability, reproducibility, and data fidelity of the Sphere testbed environment, contributing to testbed stability improvements and ensuring high-quality research data collection for ongoing security studies.",
            "Documented findings and research methodologies to support academic publications and knowledge sharing within the lab, contributing to the broader understanding of IoT security challenges and mitigation strategies."
        ],
        "role": "Research Engineer",
        "company": "MonIoTr Labs, Khoury College of Computer Sciences",
        "timeline": "October 2025 - Dec 2025",
        "location": "Boston, Massachusetts, United States"
    },
    {
        "experience" : [
            "Worked as a Software Engineer at IBM India Systems Development Labs (ISDL), the company's largest development hub, contributing to one of IBM's highest revenue-generating products built with Java and Spring, and playing a key role in core engineering and architecture overhauls.",
            "Played a key role in migrating the product architecture from OSGi (Virgo)-based Spring to a monolithic Spring Boot application, simplifying modular complexity and improving system stability by 25% through resolved dependency injection and rewritten shared services.",
            "Designed and executed a rolling upgrade and consolidation of PostgreSQL to a unified MongoDB collection (handling ~5M documents), merging instances for 20% faster queries and improved scalability, supporting production rolling upgrades.",
            "Enhanced backend platform stability by mitigating memory leaks, optimizing session management logic, and resolving thread synchronization flaws, reducing memory usage by ~30% and improving runtime reliability by 15%.",
            "Improved backend logging and observability by implementing log rotation, indexing, and standardized logs across modules, resulting in a 7% performance improvement and easier diagnostics.",
            "Led the OS upgrade initiative from RHEL 8.7 to 9.5, adapting the entire backend codebase and system dependencies, and building a custom RHEL-based ISO, cutting upgrade downtime by 40% across 500+ servers and reducing image size by ~82% (11 GB to 2 GB).",
            "Contributed to Node.js middleware optimization, refactoring backend code to enable faster UI-to-backend communication and reduce payload latency for end-users.",
            "Strengthened product security posture by addressing high-impact vulnerabilities, patching CVEs, and enforcing updated encryption and validation mechanisms, leading to an 11% improvement in security compliance.",
            "Handled critical backend-related system upgrades, including kernel patches, Python migration (2.7 & 3.6 to 3.9), and WinRM integration enhancements, resolving legacy compatibility blockers.",
            "Migrated and optimized numerous shell/bash-based automation scripts across backend components, automating 40% of manual data processing tasks and improving environment setup times.",
            "Implemented and redesigned BIRT reports from scratch to improve analytics and operational transparency; developed 3 detailed reports and improved multiple legacy ones with optimized queries for 20% improved customized analytics.",
            "Owned end-to-end deployment flows, handling release builds, final packaging, and publishing—ensuring stable, repeatable backend delivery across internal and external environments.",
            "Took complete ownership of staging and build environment setup on new OS (RHEL 9.5): configured fresh build servers, managed Maven dependencies, and deployed backend binaries to public repositories across release pipelines.",
            "Regularly represented engineering in high-pressure customer escalations (critsits), directly resolving critical backend blockers within hours, restoring systems from crash to live operation within a day for 10+ high-priority clients",
            "Participated in IBM WatsonX Hackathons, IBM Sangam Open Source events, and internal architecture forums — continuously contributing ideas and learning from cross-team collaboration."      
        ],
        "role" : "Software Engineer",
        "company" : "IBM",
        "timeline" : "August 2023 - June 2025",
        "location": "Pune, India"
    },
    {
        "experience" :[ 
            "Built a full-stack machine management tool from scratch using React.js (frontend), Node.js + MySQL (backend), and Docker for containerization — deployed seamlessly on a virtual machine, reducing resource allocation time by 25% and used by IBM teams for real-time monitoring and test infrastructure configuration.",
            "Integrated Python scripts to fetch deep system-level VM insights (CPU, memory, disk stats), enhancing resource visibility and improving overall tool capability and efficiency by over 30% through automated monitoring and reporting, reducing manual lookup time drastically.",
            "Designed the platform to be fully modular and configurable — incorporated team-specific customizations which made the tool adaptable across different IBM teams with varying needs.",
            "Collaborated with multiple SMEs, STSMs, and senior architects to gather requirements and refine the UX — earned widespread recognition for the solution's usability and practical relevance.",
            "The tool gained traction beyond the initial scope and was adopted by cross-functional teams, becoming part of their standard workflow for test environment management.",
            "Automted critical test cases for teams working on IBM Storage Protect Plus (SPP) — reducing manual QA cycles by 40% through accelerated validation workflows, saving hours of manual effort per release cycle.",
            "Contributed to the enhancement of IBM's internal automation framework (CBA), optimizing repeated tasks and processes and helping scale automated testing for large-scale environments.",
            "Gained hands-on experience in full-stack development, containerized deployments, backend API design, and system diagnostics — while closely working in an Agile setup with rapid feedback and iteration cycles.",
            "Shadowed senior engineers during design reviews and internal product discussions, which offered firsthand exposure to how scalable enterprise tools are conceptualized, pitched, and delivered."
        ],
        "role" : "Software Engineer Intern",
        "company" : "IBM",
        "timeline" : "Jan 2023 - July 2023",
        "location": "Pune, India"
    },
    {
        "experience" : [
            "Took the initiative to kickstart a project predicting used car prices using real-world datasets — led the initial setup including dataset exploration, preprocessing, and model experimentation.",
            "Implemented a Random Forest algorithm, achieving an accuracy of 93%, and benchmarked it against other models like Decision Trees and Linear Regression to identify the best fit for our scenario.",
            "Drove feature engineering efforts, transforming raw input into meaningful features that significantly boosted model reliability and predictive power.",
            "Collaborated closely with a team of interns and full-time engineers — contributed to group brainstorming sessions focused on improving algorithm efficiency and exploring ensemble strategies.",
            "Explored cross-validation techniques and hyperparameter tuning to ensure model robustness and eliminate overfitting, delivering consistent performance across unseen data.",
            "Contributed to deployment planning discussions, ensuring the model was designed with scalability and real-world integration in mind, even if not productized during the internship.",
            "Documented findings and model comparisons, and presented outcomes to mentors and peers — turning technical exploration into understandable insights for team-wide learning."
        ],
        "role" : "Machine Learning Intern",
        "company" : "Verzeo",
        "timeline" : "June 2020 - August 2020",
        "location": "Hyderabad, India"
    }
]